_blog/pdfsync.tex
% Created 2015-03-05 Thu 18:11
\documentclass{article}
\usepackage[top=1in, bottom=1.in, left=1in, right=1in]{geometry}


\usepackage[utf8]{inputenc}
\usepackage{lmodern}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{amsmath}
\usepackage[version=3]{mhchem}
\usepackage[numbers,super,sort&compress]{natbib}
\usepackage{natmove}
\usepackage{url}
\usepackage{minted}
\usepackage{underscore}
\usepackage[linktocpage,pdfstartview=FitH,colorlinks,
linkcolor=blue,anchorcolor=blue,
citecolor=blue,filecolor=blue,menucolor=blue,urlcolor=blue]{hyperref}
\usepackage{attachfile}
\author{John Kitchin}
\date{\today}
\title{pdfsync}
\begin{document}

\tableofcontents

\section{PDFsync for org files}
\label{sec-1}


\(e^x = 3.14\)

First, we need a way to check if the current buffer has changed since the last time we built so we can avoid unnecessary builds. We can use an md5 sum for this. We will just store the md5 sum in a global variable, so we can compare it at any point in time.

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos]{common-lisp}
(md5 (current-buffer))
\end{minted}

\begin{verbatim}
203af8310c9cff1c4aba54e922d94d79
\end{verbatim}

We want our build to happen asynchronously, so we can continue typing. First, we develop the build function.

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos]{common-lisp}
(defvar *last-md5* nil "md5 of current buffer")
(defvar *async-building* nil "is a build happening")

(setq *async-building* nil)
(defun async-build ()
  (interactive)
  (cond
   (*async-building*
    (message "Build in progress"))
   ((equal *last-md5* (md5 (current-buffer)))
    (message "No change to build"))
   (t
    (message "building")
    (setq *last-md5* (md5 (current-buffer)))
    (setq *async-building* t)
    (save-buffer)
    (org-latex-export-to-pdf t))))
\end{minted}
\begin{verbatim}
async-build
\end{verbatim}

That last function will launch an asynchronous build process. We can see the contents and progress of this in this variable.

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos]{common-lisp}
org-export-stack-contents
\end{minted}
\begin{center}
\begin{tabular}{lll}
\textbf{Org Export Process} & nil & org-export-process\\
/Users/jkitchin/blogofile-jkitchin.github.com/\_blog/blog.pdf & latex & (21752 50592 42735 0)\\
\#<killed buffer> & nil & org-export-process\\
\end{tabular}
\end{center}


When the export is done,
\begin{minted}[frame=lines,fontsize=\scriptsize,linenos]{common-lisp}
org-export-stack-contents
\end{minted}
\begin{center}
\begin{tabular}{lll}
/Users/jkitchin/blogofile-jkitchin.github.com/\_blog/pdfsync.tex & latex & (21752 57725 897453 0)\\
\#<killed buffer> & nil & org-export-process\\
/Users/jkitchin/blogofile-jkitchin.github.com/\_blog/pdfsync.pdf & latex & (21752 57668 576629 0)\\
\#<killed buffer> & nil & org-export-process\\
/Users/jkitchin/blogofile-jkitchin.github.com/\_blog/blog.pdf & latex & (21752 52220 238830 0)\\
\#<killed buffer> & nil & org-export-process\\
\end{tabular}
\end{center}


We can view the result here in docview.
\begin{minted}[frame=lines,fontsize=\scriptsize,linenos]{common-lisp}
(find-file-other-window (caar org-export-stack-contents))
\end{minted}
\begin{verbatim}
#<buffer blog.pdf>
\end{verbatim}

The last little idea is to create an idle timer to launch the build whenever we are idle. There are some tricks we want to use. First, we need to save the timer so we can cancel it later. Second, we need two timers, one to start the build, and one to check when it is done.

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos]{common-lisp}
(defvar async-message-timer1 nil
  "Variable to store the timer in.")

(defvar async-message-timer2 nil
  "Variable to store the timer in.")

;; timer that starts builds when we are idle
(setq async-message-timer1 (run-with-idle-timer 0.5 t 'async-build))

(setq async-message-timer2
      (run-with-idle-timer
       0.5 t
       (lambda ()
         (when (and (stringp (caar org-export-stack-contents))
                    (file-exists-p (caar org-export-stack-contents))
                    (string= "pdf" (f-ext (caar org-export-stack-contents))))
           (setq *async-building* nil)
           (switch-to-buffer (get-file-buffer (caar org-export-stack-contents)))
           (find-file (caar org-export-stack-contents))))))
\end{minted}

\begin{verbatim}
[nil 0 0 500000 t (lambda nil (when (and (stringp (caar org-export-stack-contents)) (file-exists-p (caar org-export-stack-contents)) (string= "pdf" (f-ext (caar org-export-stack-contents)))) (setq *async-building* nil) (find-file-other-window (caar org-export-stack-contents)))) nil idle 0]
\end{verbatim}

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos]{common-lisp}
(cancel-timer async-message-timer1)
(cancel-timer async-message-timer2)
\end{minted}
% Emacs 24.4.1 (Org mode 8.2.10)
\end{document}